package academy2.practice.students.dto;

public class StudentNames {
    public static String[] names = {"Александр","Дмитрий","Максим","Сергей","Андрей","Алексей","Артём","Илья","Кирилл",
            "Михаил","Никита","Матвей","Роман","Егор","Арсений","Иван","Денис","Евгений","Даниил","Тимофей ","Владислав",
            "Игорь ","Владимир ","Павел ","Руслан ","Марк ","Константин ","Тимур ","Олег ","Ярослав ","Антон ","Николай",
            "Глеб ","Данил ","Савелий ","Вадим ","Степан ","Юрий ","Богдан ","Артур ","Семен ","Макар ","Лев ","Виктор ",
            "Елисей ","Виталий ","Вячеслав ","Захар ","Мирон ","Дамир ","Анастасия","Анна","Мария","Елена","Дарья","Алина",
            "Ирина","Екатерина","Арина","Полина","Ольга","Юлия","Татьяна","Наталья","Виктория","Елизавета","Ксения","Милана",
            "Вероника","Алиса","Валерия","Александра","Ульяна","Кристина","София","Марина","Светлана","Варвара","Софья","Диана",
            "Яна","Кира","Ангелина","Маргарита","Ева","Алёна","Дарина","Карина","Василиса","Олеся","Аделина","Оксана","Таисия",
            "Надежда","Евгения","Элина","Злата","Есения","Милена","Вера"};
}
